In [3]:
import pandas as pd
df = pd.read_csv('employees.csv')
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   object
 3   Last Login Time    1000 non-null   object
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  933 non-null    object
 7   Team               957 non-null    object
dtypes: float64(1), int64(1), object(6)
memory usage: 62.6+ KB

In [6]:
type(df['Start Date'][0])

str

In [8]:
df['Start Date'] = pd.to_datetime(df['Start Date'])

In [11]:
df['Last Login Time'] = pd.to_datetime(df['Last Login Time'])

In [12]:
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2021-11-03 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2021-11-03 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2021-11-03 11:17:00,130590,11.858,False,Finance

In [14]:
df['Senior Management'] = df['Senior Management'].astype('bool')

In [15]:
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2021-11-03 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2021-11-03 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2021-11-03 11:17:00,130590,11.858,False,Finance

In [17]:
df['Gender'] = df['Gender'].astype('category')

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    category
 2   Start Date         1000 non-null   datetime64[ns]
 3   Last Login Time    1000 non-null   datetime64[ns]
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  1000 non-null   bool
 7   Team               957 non-null    object
dtypes: bool(1), category(1), datetime64[ns](2), float64(1), int64(1), object(2)
memory usage: 49.1+ KB

In [19]:
49 / 62.6

0.7827476038338658

In [1]:
import pandas as pd
df = pd.read_csv('employees.csv', parse_dates = ['Start Date', 'Last Login Time'])
df['Senior Management'] = df['Senior Management'].astype('bool')
df['Gender'] = df['Gender'].astype('category')
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2021-11-04 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2021-11-04 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2021-11-04 11:17:00,130590,11.858,False,Finance

In [6]:
mask1 = df['Gender'] == 'Male'
mask2 = df['Team'] == 'Marketing'

df[mask1 & mask2]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2021-11-04 12:42:00,97308,6.945,True,Marketing
21,Matthew,Male,1995-09-05,2021-11-04 02:12:00,100612,13.645,False,Marketing
26,Craig,Male,2000-02-27,2021-11-04 07:45:00,37598,7.757,True,Marketing
74,Thomas,Male,1995-06-04,2021-11-04 14:24:00,62096,17.029,False,Marketing
77,Charles,Male,2004-09-14,2021-11-04 20:13:00,107391,1.260,True,Marketing
101,Aaron,Male,2012-02-17,2021-11-04 10:20:00,61602,11.849,True,Marketing
104,John,Male,1989-12-23,2021-11-04 07:01:00,80740,19.305,False,Marketing
112,Willie,Male,2003-11-27,2021-11-04 06:21:00,64363,4.023,False,Marketing
119,Paul,Male,2008-06-03,2021-11-04 15:05:00,41054,12.299,False,Marketing
150,Sean,Male,1996-05-04,2021-11-04 20:59:00,135490,19.934,False,Marketing
187,Roger,Male,2004-11-19,2021-11-04 15:55:00,51430,6.460,False,Marketing
204,Willie,Male,2006-06-06,2021-11-04 09:45:00,55281,4.935,True,Marketing
216,Matthew,Male,2013-07-31,2021-11-04 08:04:00,142373,2.462,False,Marketing
252,Ralph,Male,2004-11-11,2021-11-04 01:35:00,71896,4.232,True,Marketing
274,Howard,Male,1982-10-05,2021-11-04 07:22:00,97490,5.460,True,Marketing
293,Jesse,Male,1999-10-25,2021-11-04 15:35:00,118733,9.653,False,Marketing
309,Benjamin,Male,1984-09-11,2021-11-04 06:37:00,84810,15.794,False,Marketing
327,Aaron,Male,1994-01-29,2021-11-04 18:48:00,58755,5.097,True,Marketing
353,NaN,Male,1997-04-22,2021-11-04 21:36:00,65078,3.095,True,Marketing
403,Craig,Male,1984-02-08,2021-11-04 04:45:00,113506,19.642,False,Marketing
413,Johnny,Male,1992-09-14,2021-11-04 08:21:00,115194,5.861,True,Marketing
452,Scott,Male,2012-11-17,2021-11-04 14:47:00,146812,1.965,True,Marketing
454,NaN,Male,1995-02-21,2021-11-04 00:26:00,136602,10.429,True,Marketing
461,Jeremy,Male,2001-08-09,2021-11-04 03:56:00,43354,13.946,False,Marketing
464,Lawrence,Male,2005-05-13,2021-11-04 01:25:00,74640,18.641,False,Marketing
484,Joe,Male,2000-04-14,2021-11-04 15:14:00,50645,11.119,False,Marketing
496,Johnny,Male,2016-02-26,2021-11-04 19:39:00,76394,5.437,True,Marketing
503,Roger,Male,2015-08-03,2021-11-04 16:56:00,125033,4.887,True,Marketing
544,Roger,Male,2010-07-03,2021-11-04 17:11:00,105689,13.320,True,Marketing
550,Gregory,Male,1984-06-18,2021-11-04 03:46:00,82726,16.304,True,Marketing
556,Arthur,Male,2014-12-16,2021-11-04 16:56:00,66819,6.639,True,Marketing
571,Jonathan,Male,1995-04-06,2021-11-04 22:38:00,56993,18.623,False,Marketing
581,Ernest,Male,1990-01-28,2021-11-04 00:08:00,81919,15.118,False,Marketing
696,Samuel,Male,2012-05-25,2021-11-04 16:40:00,85550,11.593,True,Marketing
722,Joshua,Male,1997-06-27,2021-11-04 15:23:00,95003,5.197,True,Marketing
798,Lawrence,Male,1984-10-01,2021-11-04 14:06:00,102589,17.952,True,Marketing
860,Phillip,Male,1984-10-07,2021-11-04 11:05:00,36837,14.660,False,Marketing
867,Earl,Male,2013-06-15,2021-11-04 03:00:00,48046,7.737,False,Marketing
899,Walter,Male,1992-05-21,2021-11-04 00:39:00,144701,16.323,True,Marketing
947,NaN,Male,2012-07-30,2021-11-04 15:07:00,107351,5.329,True,Marketing
994,George,Male,2013-06-21,2021-11-04 17:47:00,98874,4.479,True,Marketing

In [1]:
import pandas as pd
df = pd.read_csv('employees.csv', parse_dates = ['Start Date', 'Last Login Time'])
df['Senior Management'] = df['Senior Management'].astype('bool')
df['Gender'] = df['Gender'].astype('category')
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2022-01-31 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2022-01-31 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2022-01-31 11:17:00,130590,11.858,False,Finance

In [7]:
df[df['Gender'] == 'Male']

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2021-11-08 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2021-11-08 06:53:00,61933,4.170,True,NaN
3,Jerry,Male,2005-03-04,2021-11-08 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2021-11-08 16:47:00,101004,1.389,True,Client Services
5,Dennis,Male,1987-04-18,2021-11-08 01:35:00,115163,10.125,False,Legal
...,...,...,...,...,...,...,...,...
994,George,Male,2013-06-21,2021-11-08 17:47:00,98874,4.479,True,Marketing
996,Phillip,Male,1984-01-31,2021-11-08 06:30:00,42392,19.675,False,Finance
997,Russell,Male,2013-05-20,2021-11-08 12:39:00,96914,1.421,False,Product
998,Larry,Male,2013-04-20,2021-11-08 16:45:00,60500,11.985,False,Business Development
999,Albert,Male,2012-05-15,2021-11-08 18:24:00,129949,10.169,True,Sales

In [12]:
mask = df['Team'] == 'Finance'
df[mask]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
2,Maria,Female,1993-04-23,2021-11-08 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2021-11-08 13:00:00,138705,9.340,True,Finance
7,NaN,Female,2015-07-20,2021-11-08 10:43:00,45906,11.598,True,Finance
14,Kimberly,Female,1999-01-14,2021-11-08 07:13:00,41426,14.543,True,Finance
46,Bruce,Male,2009-11-28,2021-11-08 22:47:00,114796,6.796,False,Finance
...,...,...,...,...,...,...,...,...
907,Elizabeth,Female,1998-07-27,2021-11-08 11:12:00,137144,10.081,False,Finance
954,Joe,Male,1980-01-19,2021-11-08 16:06:00,119667,1.148,True,Finance
987,Gloria,Female,2014-12-08,2021-11-08 05:08:00,136709,10.331,True,Finance
992,Anthony,Male,2011-10-16,2021-11-08 08:35:00,112769,11.625,True,Finance
996,Phillip,Male,1984-01-31,2021-11-08 06:30:00,42392,19.675,False,Finance

In [14]:
mask = df['Senior Management']
df[mask]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2021-11-08 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2021-11-08 06:53:00,61933,4.170,True,NaN
3,Jerry,Male,2005-03-04,2021-11-08 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2021-11-08 16:47:00,101004,1.389,True,Client Services
6,Ruby,Female,1987-08-17,2021-11-08 16:20:00,65476,10.012,True,Product
...,...,...,...,...,...,...,...,...
991,Rose,Female,2002-08-25,2021-11-08 05:12:00,134505,11.051,True,Marketing
992,Anthony,Male,2011-10-16,2021-11-08 08:35:00,112769,11.625,True,Finance
993,Tina,Female,1997-05-15,2021-11-08 15:53:00,56450,19.040,True,Engineering
994,George,Male,2013-06-21,2021-11-08 17:47:00,98874,4.479,True,Marketing
999,Albert,Male,2012-05-15,2021-11-08 18:24:00,129949,10.169,True,Sales

In [18]:
mask = df['Team'] != 'Marketing'
df[mask]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
1,Thomas,Male,1996-03-31,2021-11-08 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2021-11-08 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2021-11-08 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2021-11-08 16:47:00,101004,1.389,True,Client Services
5,Dennis,Male,1987-04-18,2021-11-08 01:35:00,115163,10.125,False,Legal
...,...,...,...,...,...,...,...,...
995,Henry,NaN,2014-11-23,2021-11-08 06:09:00,132483,16.655,False,Distribution
996,Phillip,Male,1984-01-31,2021-11-08 06:30:00,42392,19.675,False,Finance
997,Russell,Male,2013-05-20,2021-11-08 12:39:00,96914,1.421,False,Product
998,Larry,Male,2013-04-20,2021-11-08 16:45:00,60500,11.985,False,Business Development
999,Albert,Male,2012-05-15,2021-11-08 18:24:00,129949,10.169,True,Sales

In [21]:
mask = df['Salary'] > 110000
df[mask]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
2,Maria,Female,1993-04-23,2021-11-08 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2021-11-08 13:00:00,138705,9.340,True,Finance
5,Dennis,Male,1987-04-18,2021-11-08 01:35:00,115163,10.125,False,Legal
9,Frances,Female,2002-08-08,2021-11-08 06:51:00,139852,7.524,True,Business Development
12,Brandon,Male,1980-12-01,2021-11-08 01:08:00,112807,17.492,True,Human Resources
...,...,...,...,...,...,...,...,...
987,Gloria,Female,2014-12-08,2021-11-08 05:08:00,136709,10.331,True,Finance
991,Rose,Female,2002-08-25,2021-11-08 05:12:00,134505,11.051,True,Marketing
992,Anthony,Male,2011-10-16,2021-11-08 08:35:00,112769,11.625,True,Finance
995,Henry,NaN,2014-11-23,2021-11-08 06:09:00,132483,16.655,False,Distribution
999,Albert,Male,2012-05-15,2021-11-08 18:24:00,129949,10.169,True,Sales

In [26]:
mask = df['Bonus %'] < 1.5
df[mask]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
4,Larry,Male,1998-01-24,2021-11-08 16:47:00,101004,1.389,True,Client Services
15,Lillian,Female,2016-06-05,2021-11-08 06:09:00,59414,1.256,False,Product
58,Theresa,Female,2010-04-11,2021-11-08 07:18:00,72670,1.481,True,Engineering
77,Charles,Male,2004-09-14,2021-11-08 20:13:00,107391,1.260,True,Marketing
175,Willie,Male,1998-02-17,2021-11-08 20:20:00,146651,1.451,True,Engineering
189,Clarence,Male,1998-05-02,2021-11-08 03:16:00,85700,1.215,False,Sales
217,Douglas,Male,1999-09-03,2021-11-08 16:00:00,83341,1.015,True,Client Services
273,Nicholas,Male,1994-04-12,2021-11-08 20:21:00,74669,1.113,True,Product
279,Ruby,Female,2000-11-08,2021-11-08 19:35:00,105946,1.139,False,Business Development
365,Gloria,NaN,1983-07-19,2021-11-08 01:57:00,140885,1.113,False,Human Resources
445,Chris,Male,2006-12-12,2021-11-08 01:57:00,71642,1.496,False,NaN
481,NaN,Female,2013-04-27,2021-11-08 06:40:00,93847,1.085,True,Business Development
527,Helen,NaN,1993-12-02,2021-11-08 13:42:00,45724,1.022,False,Product
570,Kelly,Female,1996-08-16,2021-11-08 03:09:00,41427,1.431,False,Product
578,Amanda,Female,1982-03-17,2021-11-08 23:46:00,107111,1.438,True,Product
579,Harold,Male,2010-10-18,2021-11-08 20:45:00,65673,1.187,True,Legal
617,Kathy,Female,2001-01-14,2021-11-08 05:11:00,45682,1.451,True,Marketing
618,Peter,Male,1992-11-24,2021-11-08 17:43:00,69297,1.268,False,Finance
638,Frances,Female,1996-11-12,2021-11-08 18:08:00,112467,1.433,False,Business Development
652,Willie,Male,2009-12-05,2021-11-08 05:39:00,141932,1.017,True,Engineering
708,Steve,Male,2002-01-11,2021-11-08 21:17:00,51821,1.197,True,Legal
732,Henry,Male,1986-05-12,2021-11-08 02:04:00,59943,1.432,False,Finance
734,NaN,Female,1994-12-18,2021-11-08 20:42:00,138807,1.400,True,Human Resources
746,Gloria,Female,2004-08-19,2021-11-08 10:31:00,46602,1.027,True,Business Development
912,Joe,Male,1998-12-08,2021-11-08 10:28:00,126120,1.020,False,NaN
929,Theresa,Female,2001-04-27,2021-11-08 21:17:00,75661,1.079,True,Legal
954,Joe,Male,1980-01-19,2021-11-08 16:06:00,119667,1.148,True,Finance
997,Russell,Male,2013-05-20,2021-11-08 12:39:00,96914,1.421,False,Product

In [30]:
mask = df['Start Date'] <= '1995-01-01'
df[mask]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2021-11-08 12:42:00,97308,6.945,True,Marketing
2,Maria,Female,1993-04-23,2021-11-08 11:17:00,130590,11.858,False,Finance
5,Dennis,Male,1987-04-18,2021-11-08 01:35:00,115163,10.125,False,Legal
6,Ruby,Female,1987-08-17,2021-11-08 16:20:00,65476,10.012,True,Product
10,Louise,Female,1980-08-12,2021-11-08 09:01:00,63241,15.132,True,NaN
...,...,...,...,...,...,...,...,...
985,Stephen,NaN,1983-07-10,2021-11-08 20:10:00,85668,1.909,False,Legal
986,Donna,Female,1982-11-26,2021-11-08 07:04:00,82871,17.999,False,Marketing
989,Justin,NaN,1991-02-10,2021-11-08 16:58:00,38344,3.794,False,Legal
990,Robin,Female,1987-07-24,2021-11-08 13:35:00,100765,10.982,True,Client Services
996,Phillip,Male,1984-01-31,2021-11-08 06:30:00,42392,19.675,False,Finance

In [2]:
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2022-01-31 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2022-01-31 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2022-01-31 11:17:00,130590,11.858,False,Finance

In [5]:
mask1 = df['Senior Management']

In [7]:
mask2 = df['Start Date'] < '1990-01-01'

In [8]:
df[mask1 | mask2]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2022-01-31 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2022-01-31 06:53:00,61933,4.170,True,NaN
3,Jerry,Male,2005-03-04,2022-01-31 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2022-01-31 16:47:00,101004,1.389,True,Client Services
5,Dennis,Male,1987-04-18,2022-01-31 01:35:00,115163,10.125,False,Legal
...,...,...,...,...,...,...,...,...
992,Anthony,Male,2011-10-16,2022-01-31 08:35:00,112769,11.625,True,Finance
993,Tina,Female,1997-05-15,2022-01-31 15:53:00,56450,19.040,True,Engineering
994,George,Male,2013-06-21,2022-01-31 17:47:00,98874,4.479,True,Marketing
996,Phillip,Male,1984-01-31,2022-01-31 06:30:00,42392,19.675,False,Finance
999,Albert,Male,2012-05-15,2022-01-31 18:24:00,129949,10.169,True,Sales

In [11]:
mask1 = df['First Name'] == 'Robert'

In [12]:
mask2 = df['Team'] == 'Client Services'

In [16]:
mask3 = df['Start Date'] > '2016-06-01'

In [17]:
df[(mask1 & mask2) | mask3]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
15,Lillian,Female,2016-06-05,2022-01-31 06:09:00,59414,1.256,False,Product
98,Tina,Female,2016-06-16,2022-01-31 19:47:00,100705,16.961,True,Marketing
387,Robert,Male,1994-10-29,2022-01-31 04:26:00,123294,19.894,False,Client Services
451,Terry,NaN,2016-07-15,2022-01-31 00:29:00,140002,19.490,True,Marketing